In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
train=pd.read_csv('Train.csv')
test=pd.read_csv('Test.csv')

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 24 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Employee_ID                7000 non-null   object
 1   Gender                     7000 non-null   object
 2   Age                        6588 non-null   float64
 3   Education_Level            7000 non-null   int64
 4   Relationship_Status        7000 non-null   object
 5   Hometown                   7000 non-null   object
 6   Unit                       7000 non-null   object
 7   Decision_skill_possess     7000 non-null   object
 8   Time_of_service            6856 non-null   float64
 9   Time_since_promotion       7000 non-null   int64
 10  growth_rate                7000 non-null   int64
 11  Travel_Rate                7000 non-null   int64
 12  Post_Level                 7000 non-null   int64
 13  Pay_Scale                  6991 non-null   float64
 14  Compensation_and_Benefits  7000 non-null   object
 15  Work_Life_balance          6989 non-null   float64
 16  VAR1                       7000 non-null   int64
 17  VAR2                       6423 non-null   float64
 18  VAR3                       7000 non-null   float64
 19  VAR4                       6344 non-null   float64
 20  VAR5                       7000 non-null   int64
 21  VAR6                       7000 non-null   int64
 22  VAR7                       7000 non-null   int64
 23  Attrition_rate             7000 non-null   float64
dtypes: float64(8), int64(9), object(7)
memory usage: 1.3+ MB

In [4]:
train.head()

  Employee_ID Gender   Age  Education_Level  ... VAR5 VAR6 VAR7 Attrition_rate
0   EID_23371      F  42.0                4  ...    4    5    3         0.1841
1   EID_18000      M  24.0                3  ...    3    5    3         0.0670
2    EID_3891      F  58.0                3  ...    3    8    3         0.0851
3   EID_17492      F  26.0                3  ...    3    7    3         0.0668
4   EID_22534      F  31.0                1  ...    2    8    2         0.1827

[5 rows x 24 columns]

In [5]:
Gender = pd.get_dummies(train['Gender'],drop_first=True)
Relationship_Status=pd.get_dummies(train['Relationship_Status'],drop_first=True)
Hometown=pd.get_dummies(train['Hometown'],drop_first=True)
Unit=pd.get_dummies(train['Unit'],drop_first=True)
Decision_skill_possess=pd.get_dummies(train['Decision_skill_possess'],drop_first=True)
Compensation_and_Benefits=pd.get_dummies(train['Compensation_and_Benefits'],drop_first=True)

In [6]:
train['Hometown'].value_counts()

Lebanon        2070
Springfield    1736
Franklin       1523
Washington     1106
Clinton         565
Name: Hometown, dtype: int64

In [7]:
train.drop(['Gender','Relationship_Status','Hometown','Unit','Decision_skill_possess','Compensation_and_Benefits'],axis=1,inplace=True)

In [8]:
train = pd.concat([Gender,Relationship_Status,Hometown,Unit,Decision_skill_possess,Compensation_and_Benefits,train],axis=1)

In [9]:
train.head()

   M  Single  Franklin  Lebanon  ...  VAR5  VAR6  VAR7  Attrition_rate
0  0       0         1        0  ...     4     5     3          0.1841
1  1       1         0        0  ...     3     5     3          0.0670
2  0       0         0        0  ...     3     8     3          0.0851
3  0       1         0        1  ...     3     7     3          0.0668
4  0       0         0        0  ...     2     8     2          0.1827

[5 rows x 42 columns]

In [10]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 42 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   M                          7000 non-null   uint8
 1   Single                     7000 non-null   uint8
 2   Franklin                   7000 non-null   uint8
 3   Lebanon                    7000 non-null   uint8
 4   Springfield                7000 non-null   uint8
 5   Washington                 7000 non-null   uint8
 6   Human Resource Management  7000 non-null   uint8
 7   IT                         7000 non-null   uint8
 8   Logistics                  7000 non-null   uint8
 9   Marketing                  7000 non-null   uint8
 10  Operarions                 7000 non-null   uint8
 11  Production                 7000 non-null   uint8
 12  Purchasing                 7000 non-null   uint8
 13  Quality                    7000 non-null   uint8
 14  R&D                        7000 non-null   uint8
 15  Sales                      7000 non-null   uint8
 16  Security                   7000 non-null   uint8
 17  Behavioral                 7000 non-null   uint8
 18  Conceptual                 7000 non-null   uint8
 19  Directive                  7000 non-null   uint8
 20  type1                      7000 non-null   uint8
 21  type2                      7000 non-null   uint8
 22  type3                      7000 non-null   uint8
 23  type4                      7000 non-null   uint8
 24  Employee_ID                7000 non-null   object
 25  Age                        6588 non-null   float64
 26  Education_Level            7000 non-null   int64
 27  Time_of_service            6856 non-null   float64
 28  Time_since_promotion       7000 non-null   int64
 29  growth_rate                7000 non-null   int64
 30  Travel_Rate                7000 non-null   int64
 31  Post_Level                 7000 non-null   int64
 32  Pay_Scale                  6991 non-null   float64
 33  Work_Life_balance          6989 non-null   float64
 34  VAR1                       7000 non-null   int64
 35  VAR2                       6423 non-null   float64
 36  VAR3                       7000 non-null   float64
 37  VAR4                       6344 non-null   float64
 38  VAR5                       7000 non-null   int64
 39  VAR6                       7000 non-null   int64
 40  VAR7                       7000 non-null   int64
 41  Attrition_rate             7000 non-null   float64
dtypes: float64(8), int64(9), object(1), uint8(24)
memory usage: 1.1+ MB

In [11]:
train['Age']=train['Age'].fillna(40)

In [12]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 42 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   M                          7000 non-null   uint8
 1   Single                     7000 non-null   uint8
 2   Franklin                   7000 non-null   uint8
 3   Lebanon                    7000 non-null   uint8
 4   Springfield                7000 non-null   uint8
 5   Washington                 7000 non-null   uint8
 6   Human Resource Management  7000 non-null   uint8
 7   IT                         7000 non-null   uint8
 8   Logistics                  7000 non-null   uint8
 9   Marketing                  7000 non-null   uint8
 10  Operarions                 7000 non-null   uint8
 11  Production                 7000 non-null   uint8
 12  Purchasing                 7000 non-null   uint8
 13  Quality                    7000 non-null   uint8
 14  R&D                        7000 non-null   uint8
 15  Sales                      7000 non-null   uint8
 16  Security                   7000 non-null   uint8
 17  Behavioral                 7000 non-null   uint8
 18  Conceptual                 7000 non-null   uint8
 19  Directive                  7000 non-null   uint8
 20  type1                      7000 non-null   uint8
 21  type2                      7000 non-null   uint8
 22  type3                      7000 non-null   uint8
 23  type4                      7000 non-null   uint8
 24  Employee_ID                7000 non-null   object
 25  Age                        7000 non-null   float64
 26  Education_Level            7000 non-null   int64
 27  Time_of_service            6856 non-null   float64
 28  Time_since_promotion       7000 non-null   int64
 29  growth_rate                7000 non-null   int64
 30  Travel_Rate                7000 non-null   int64
 31  Post_Level                 7000 non-null   int64
 32  Pay_Scale                  6991 non-null   float64
 33  Work_Life_balance          6989 non-null   float64
 34  VAR1                       7000 non-null   int64
 35  VAR2                       6423 non-null   float64
 36  VAR3                       7000 non-null   float64
 37  VAR4                       6344 non-null   float64
 38  VAR5                       7000 non-null   int64
 39  VAR6                       7000 non-null   int64
 40  VAR7                       7000 non-null   int64
 41  Attrition_rate             7000 non-null   float64
dtypes: float64(8), int64(9), object(1), uint8(24)
memory usage: 1.1+ MB

In [13]:
train['Time_of_service']=train['Time_of_service'].fillna(13)

In [14]:
train['Pay_Scale']=train['Pay_Scale'].fillna(6)

In [15]:
train['Work_Life_balance']=train['Work_Life_balance'].fillna(2)

In [16]:
train['VAR2']=train['VAR2'].fillna(-0.0081)

In [17]:
train['VAR4']=train['VAR4'].fillna(2)

In [18]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 42 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   M                          7000 non-null   uint8
 1   Single                     7000 non-null   uint8
 2   Franklin                   7000 non-null   uint8
 3   Lebanon                    7000 non-null   uint8
 4   Springfield                7000 non-null   uint8
 5   Washington                 7000 non-null   uint8
 6   Human Resource Management  7000 non-null   uint8
 7   IT                         7000 non-null   uint8
 8   Logistics                  7000 non-null   uint8
 9   Marketing                  7000 non-null   uint8
 10  Operarions                 7000 non-null   uint8
 11  Production                 7000 non-null   uint8
 12  Purchasing                 7000 non-null   uint8
 13  Quality                    7000 non-null   uint8
 14  R&D                        7000 non-null   uint8
 15  Sales                      7000 non-null   uint8
 16  Security                   7000 non-null   uint8
 17  Behavioral                 7000 non-null   uint8
 18  Conceptual                 7000 non-null   uint8
 19  Directive                  7000 non-null   uint8
 20  type1                      7000 non-null   uint8
 21  type2                      7000 non-null   uint8
 22  type3                      7000 non-null   uint8
 23  type4                      7000 non-null   uint8
 24  Employee_ID                7000 non-null   object
 25  Age                        7000 non-null   float64
 26  Education_Level            7000 non-null   int64
 27  Time_of_service            7000 non-null   float64
 28  Time_since_promotion       7000 non-null   int64
 29  growth_rate                7000 non-null   int64
 30  Travel_Rate                7000 non-null   int64
 31  Post_Level                 7000 non-null   int64
 32  Pay_Scale                  7000 non-null   float64
 33  Work_Life_balance          7000 non-null   float64
 34  VAR1                       7000 non-null   int64
 35  VAR2                       7000 non-null   float64
 36  VAR3                       7000 non-null   float64
 37  VAR4                       7000 non-null   float64
 38  VAR5                       7000 non-null   int64
 39  VAR6                       7000 non-null   int64
 40  VAR7                       7000 non-null   int64
 41  Attrition_rate             7000 non-null   float64
dtypes: float64(8), int64(9), object(1), uint8(24)
memory usage: 1.1+ MB

In [19]:
train.drop('Employee_ID',axis=1,inplace=True)

In [20]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7000 entries, 0 to 6999
Data columns (total 41 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   M                          7000 non-null   uint8
 1   Single                     7000 non-null   uint8
 2   Franklin                   7000 non-null   uint8
 3   Lebanon                    7000 non-null   uint8
 4   Springfield                7000 non-null   uint8
 5   Washington                 7000 non-null   uint8
 6   Human Resource Management  7000 non-null   uint8
 7   IT                         7000 non-null   uint8
 8   Logistics                  7000 non-null   uint8
 9   Marketing                  7000 non-null   uint8
 10  Operarions                 7000 non-null   uint8
 11  Production                 7000 non-null   uint8
 12  Purchasing                 7000 non-null   uint8
 13  Quality                    7000 non-null   uint8
 14  R&D                        7000 non-null   uint8
 15  Sales                      7000 non-null   uint8
 16  Security                   7000 non-null   uint8
 17  Behavioral                 7000 non-null   uint8
 18  Conceptual                 7000 non-null   uint8
 19  Directive                  7000 non-null   uint8
 20  type1                      7000 non-null   uint8
 21  type2                      7000 non-null   uint8
 22  type3                      7000 non-null   uint8
 23  type4                      7000 non-null   uint8
 24  Age                        7000 non-null   float64
 25  Education_Level            7000 non-null   int64
 26  Time_of_service            7000 non-null   float64
 27  Time_since_promotion       7000 non-null   int64
 28  growth_rate                7000 non-null   int64
 29  Travel_Rate                7000 non-null   int64
 30  Post_Level                 7000 non-null   int64
 31  Pay_Scale                  7000 non-null   float64
 32  Work_Life_balance          7000 non-null   float64
 33  VAR1                       7000 non-null   int64
 34  VAR2                       7000 non-null   float64
 35  VAR3                       7000 non-null   float64
 36  VAR4                       7000 non-null   float64
 37  VAR5                       7000 non-null   int64
 38  VAR6                       7000 non-null   int64
 39  VAR7                       7000 non-null   int64
 40  Attrition_rate             7000 non-null   float64
dtypes: float64(8), int64(9), uint8(24)
memory usage: 1.1 MB

In [21]:
X = train.iloc[:, :40].values
y = train.iloc[:, 40].values

In [22]:
from sklearn.model_selection import train_test_split
X_train_full, X_test, y_train_full, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42)
X_train, X_valid, y_train, y_valid = train_test_split(X_train_full, y_train_full, random_state=42)

In [23]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_valid = scaler.transform(X_valid)
X_test = scaler.transform(X_test)

In [24]:
X_train.shape

(4200, 40)

In [25]:
import tensorflow as tf
from tensorflow import keras
np.random.seed(42)
tf.random.set_seed(42)

In [26]:
model = keras.models.Sequential([
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu", input_shape=[40]),
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(25, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(10, kernel_initializer = 'uniform',activation="relu"),
    keras.layers.Dense(1)
])

In [27]:
model.compile(loss="mean_squared_error", 
              optimizer=keras.optimizers.SGD(lr=1e-3), 
              metrics=['mae'])

In [28]:
checkpoint_cb = keras.callbacks.ModelCheckpoint("early_stop_model.h5", save_best_only=True)

In [29]:
early_stopping_cb = keras.callbacks.EarlyStopping(patience=10,
                                                  restore_best_weights=True)

In [30]:
model_history = model.fit(X_train, y_train,batch_size=32, epochs=500, validation_data=(X_valid, y_valid),callbacks=[checkpoint_cb, early_stopping_cb])

Epoch 1/500
132/132 [==============================] - 0s 3ms/step - loss: 0.0552 - mae: 0.1538 - val_loss: 0.0498 - val_mae: 0.1367
Epoch 2/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0408 - mae: 0.1235 - val_loss: 0.0413 - val_mae: 0.1239
Epoch 3/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0360 - mae: 0.1182 - val_loss: 0.0383 - val_mae: 0.1237
Epoch 4/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0344 - mae: 0.1190 - val_loss: 0.0373 - val_mae: 0.1257
Epoch 5/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0339 - mae: 0.1210 - val_loss: 0.0369 - val_mae: 0.1276
Epoch 6/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0338 - mae: 0.1225 - val_loss: 0.0368 - val_mae: 0.1289
Epoch 7/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1236 - val_loss: 0.0367 - val_mae: 0.1296
Epoch 8/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1241 - val_loss: 0.0367 - val_mae: 0.1301
Epoch 9/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1245 - val_loss: 0.0367 - val_mae: 0.1304
Epoch 10/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1247 - val_loss: 0.0366 - val_mae: 0.1306
Epoch 11/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1249 - val_loss: 0.0366 - val_mae: 0.1306
Epoch 12/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1249 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 13/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1251 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 14/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1250 - val_loss: 0.0367 - val_mae: 0.1306
Epoch 15/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1250 - val_loss: 0.0366 - val_mae: 0.1306
Epoch 16/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1248 - val_loss: 0.0366 - val_mae: 0.1308
Epoch 17/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1252 - val_loss: 0.0366 - val_mae: 0.1308
Epoch 18/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1249 - val_loss: 0.0366 - val_mae: 0.1309
Epoch 19/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1253 - val_loss: 0.0366 - val_mae: 0.1308
Epoch 20/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1252 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 21/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1251 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 22/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1252 - val_loss: 0.0366 - val_mae: 0.1306
Epoch 23/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1251 - val_loss: 0.0367 - val_mae: 0.1305
Epoch 24/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1247 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 25/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1249 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 26/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1252 - val_loss: 0.0367 - val_mae: 0.1306
Epoch 27/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1248 - val_loss: 0.0366 - val_mae: 0.1307
Epoch 28/500
132/132 [==============================] - 0s 2ms/step - loss: 0.0337 - mae: 0.1251 - val_loss: 0.0367 - val_mae: 0.1305

In [31]:
model = keras.models.load_model("early_stop_model.h5")

In [32]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 23 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Employee_ID                3000 non-null   object
 1   Gender                     3000 non-null   object
 2   Age                        2839 non-null   float64
 3   Education_Level            3000 non-null   int64
 4   Relationship_Status        3000 non-null   object
 5   Hometown                   3000 non-null   object
 6   Unit                       3000 non-null   object
 7   Decision_skill_possess     3000 non-null   object
 8   Time_of_service            2948 non-null   float64
 9   Time_since_promotion       3000 non-null   int64
 10  growth_rate                3000 non-null   int64
 11  Travel_Rate                3000 non-null   int64
 12  Post_Level                 3000 non-null   int64
 13  Pay_Scale                  2997 non-null   float64
 14  Compensation_and_Benefits  3000 non-null   object
 15  Work_Life_balance          2995 non-null   float64
 16  VAR1                       3000 non-null   int64
 17  VAR2                       2783 non-null   float64
 18  VAR3                       3000 non-null   float64
 19  VAR4                       2702 non-null   float64
 20  VAR5                       3000 non-null   int64
 21  VAR6                       3000 non-null   int64
 22  VAR7                       3000 non-null   int64
dtypes: float64(7), int64(9), object(7)
memory usage: 539.2+ KB

In [33]:
Gender = pd.get_dummies(test['Gender'],drop_first=True)
Relationship_Status=pd.get_dummies(test['Relationship_Status'],drop_first=True)
Hometown=pd.get_dummies(test['Hometown'],drop_first=True)
Unit=pd.get_dummies(test['Unit'],drop_first=True)
Decision_skill_possess=pd.get_dummies(test['Decision_skill_possess'],drop_first=True)
Compensation_and_Benefits=pd.get_dummies(test['Compensation_and_Benefits'],drop_first=True)

In [34]:
test.drop(['Gender','Relationship_Status','Hometown','Unit','Decision_skill_possess','Compensation_and_Benefits'],axis=1,inplace=True)

In [35]:
test = pd.concat([Gender,Relationship_Status,Hometown,Unit,Decision_skill_possess,Compensation_and_Benefits,test],axis=1)

In [36]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 41 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   M                          3000 non-null   uint8
 1   Single                     3000 non-null   uint8
 2   Franklin                   3000 non-null   uint8
 3   Lebanon                    3000 non-null   uint8
 4   Springfield                3000 non-null   uint8
 5   Washington                 3000 non-null   uint8
 6   Human Resource Management  3000 non-null   uint8
 7   IT                         3000 non-null   uint8
 8   Logistics                  3000 non-null   uint8
 9   Marketing                  3000 non-null   uint8
 10  Operarions                 3000 non-null   uint8
 11  Production                 3000 non-null   uint8
 12  Purchasing                 3000 non-null   uint8
 13  Quality                    3000 non-null   uint8
 14  R&D                        3000 non-null   uint8
 15  Sales                      3000 non-null   uint8
 16  Security                   3000 non-null   uint8
 17  Behavioral                 3000 non-null   uint8
 18  Conceptual                 3000 non-null   uint8
 19  Directive                  3000 non-null   uint8
 20  type1                      3000 non-null   uint8
 21  type2                      3000 non-null   uint8
 22  type3                      3000 non-null   uint8
 23  type4                      3000 non-null   uint8
 24  Employee_ID                3000 non-null   object
 25  Age                        2839 non-null   float64
 26  Education_Level            3000 non-null   int64
 27  Time_of_service            2948 non-null   float64
 28  Time_since_promotion       3000 non-null   int64
 29  growth_rate                3000 non-null   int64
 30  Travel_Rate                3000 non-null   int64
 31  Post_Level                 3000 non-null   int64
 32  Pay_Scale                  2997 non-null   float64
 33  Work_Life_balance          2995 non-null   float64
 34  VAR1                       3000 non-null   int64
 35  VAR2                       2783 non-null   float64
 36  VAR3                       3000 non-null   float64
 37  VAR4                       2702 non-null   float64
 38  VAR5                       3000 non-null   int64
 39  VAR6                       3000 non-null   int64
 40  VAR7                       3000 non-null   int64
dtypes: float64(7), int64(9), object(1), uint8(24)
memory usage: 468.9+ KB

In [37]:
test['Age']=test['Age'].fillna(40)
test['Time_of_service']=test['Time_of_service'].fillna(13)
test['Pay_Scale']=test['Pay_Scale'].fillna(6)
test['Work_Life_balance']=test['Work_Life_balance'].fillna(2)
test['VAR2']=test['VAR2'].fillna(0.0275)
test['VAR4']=test['VAR4'].fillna(2)

In [38]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 41 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   M                          3000 non-null   uint8
 1   Single                     3000 non-null   uint8
 2   Franklin                   3000 non-null   uint8
 3   Lebanon                    3000 non-null   uint8
 4   Springfield                3000 non-null   uint8
 5   Washington                 3000 non-null   uint8
 6   Human Resource Management  3000 non-null   uint8
 7   IT                         3000 non-null   uint8
 8   Logistics                  3000 non-null   uint8
 9   Marketing                  3000 non-null   uint8
 10  Operarions                 3000 non-null   uint8
 11  Production                 3000 non-null   uint8
 12  Purchasing                 3000 non-null   uint8
 13  Quality                    3000 non-null   uint8
 14  R&D                        3000 non-null   uint8
 15  Sales                      3000 non-null   uint8
 16  Security                   3000 non-null   uint8
 17  Behavioral                 3000 non-null   uint8
 18  Conceptual                 3000 non-null   uint8
 19  Directive                  3000 non-null   uint8
 20  type1                      3000 non-null   uint8
 21  type2                      3000 non-null   uint8
 22  type3                      3000 non-null   uint8
 23  type4                      3000 non-null   uint8
 24  Employee_ID                3000 non-null   object
 25  Age                        3000 non-null   float64
 26  Education_Level            3000 non-null   int64
 27  Time_of_service            3000 non-null   float64
 28  Time_since_promotion       3000 non-null   int64
 29  growth_rate                3000 non-null   int64
 30  Travel_Rate                3000 non-null   int64
 31  Post_Level                 3000 non-null   int64
 32  Pay_Scale                  3000 non-null   float64
 33  Work_Life_balance          3000 non-null   float64
 34  VAR1                       3000 non-null   int64
 35  VAR2                       3000 non-null   float64
 36  VAR3                       3000 non-null   float64
 37  VAR4                       3000 non-null   float64
 38  VAR5                       3000 non-null   int64
 39  VAR6                       3000 non-null   int64
 40  VAR7                       3000 non-null   int64
dtypes: float64(7), int64(9), object(1), uint8(24)
memory usage: 468.9+ KB

In [39]:
Employee_ID=test['Employee_ID']

In [40]:
test.drop('Employee_ID',axis=1,inplace=True)

In [41]:
from sklearn.preprocessing import StandardScaler
ss=StandardScaler()
ss.fit(test)
stad_data=ss.transform(test)

In [42]:
x1=pd.DataFrame(stad_data,columns=test.columns)

In [43]:
y_pred1 = model.predict(x1)

In [44]:
y_pred1

array([[0.18854317],
       [0.1885432 ],
       [0.18854319],
       ...,
       [0.18854319],
       [0.1885432 ],
       [0.18854317]], dtype=float32)

In [45]:
df11=pd.DataFrame(y_pred1,Employee_ID,columns=['Attrition_rate'])

In [46]:
df11.head()

             Attrition_rate
Employee_ID
EID_22713          0.188543
EID_9658           0.188543
EID_22203          0.188543
EID_7652           0.188543
EID_6516           0.188543

In [47]:
df11.to_csv('final_submission7.csv')